Documents/удалить_ИА_НастройкаФП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>удалить_ИА_НастройкаФП</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникКонтрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСтатья</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникНастройкаОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникХранилищеЗапросаКонстурктора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_НастройкаОтбораХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПолученияДанных</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ВариантыПолученияДанныхВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстВыраженияЗапросаБезнал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстВыраженияЗапросаНал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРегистраБезнал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РесурсРегистраБезнал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРегистраНал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РесурсРегистраНал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеСтатьяДДСБезнал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеСтатьяДДСНал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолитикаРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фонд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_РежимРасчетаСуммы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеБезнал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_РазделыПолитикиФП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентОтИтогаРаздела</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_РазделыПолитикиФП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолитикаРаспределенияПервичная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фонд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_РежимРасчетаСуммы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеБезнал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_РазделыПолитикиФП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентОтИтогаРаздела</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_РазделыПолитикиФП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыВыраженияЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ТипДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПолученияДанных</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ВариантыПолученияДанныхВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСравнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСписка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СпискиЗначенийПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ТипДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПолученияДанных</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ВариантыПолученияДанныхВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСписка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ИА_РежимРасчетаСуммы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_РежимРасчетаСуммы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РучнойВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВычисляемоеВыражение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированнаяСумма</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/удалить_ИА_НастройкаФП/Forms/КонструкторВыраженияУпр/Ext/Form/Module.bsl
&НаКлиенте
Перем ФормаФП;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	
	Элементы.Спецдоход.Видимость = ИспользоватьСпецдоход;
	Элементы.РаспределениеСпецдохода.Видимость = ИспользоватьСпецдоход;
	
	//Элементы.ФП_РаспределениеСредствСФондов.Видимость = ИспользоватьРаспределениеСФондов;
	Элементы.ФП_РаспределениеСредствСФондов.Видимость = ложь;
	Элементы.ГруппаРСФ.Видимость = ИспользоватьРаспределениеСФондов;
	
	Элементы.ФП_ДоходыБП.Видимость = ИспользоватьСпецдоход;
	Элементы.ФП_ДоходыБП_Распределение.Видимость = ИспользоватьСпецдоход;
	
	ОбновитьОтображениеПоНалБезнал();
	
	ПроверитьФормулу(Неопределено);
	
	Заголовок = "Редактирование расчета "+ВыбРаздел+", "+ВыбПодразделение+", "+ВыбФонд;
	
	// Развернем окно. Да, вот так все сложно
	Попытка
		WSHShell = Новый COMОбъект("WScript.Shell");
    	WSHShell.SendKeys("%");
    	WSHShell.SendKeys("{LEFT}{LEFT}{ENTER}");
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	// Вставить содержимое обработчика.
	// доходы
	Доходы.ЗагрузитьЗначения(ДокНастройки.Доходы.ВыгрузитьКолонку("ВидДохода"));
	
	// спецдоход
	ВыборкаВидовДох = Справочники.ИА_ВидыДоходов.Выбрать();
	Пока ВыборкаВидовДох.Следующий() Цикл
		Если не ВыборкаВидовДох.ПометкаУдаления Тогда
			РаспределениеСпецдохода.Добавить(ВыборкаВидовДох.Ссылка);
			Спецдоход.Добавить(ВыборкаВидовДох.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	//Политика
	Мен = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Мен;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Пол1.Раздел,
	               |	Пол1.Подразделение,
	               |	Пол1.Фонд
	               |ПОМЕСТИТЬ Пол1
	               |ИЗ
	               |	&Пол1 КАК Пол1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Пол2.Раздел,
	               |	Пол2.Подразделение,
	               |	Пол2.Фонд
	               |ПОМЕСТИТЬ Пол2
	               |ИЗ
	               |	&Пол2 КАК Пол2";
	Запрос.УстановитьПараметр("Пол1", ДокНастройки.ПолитикаРаспределенияПервичная.Выгрузить()); 
	Запрос.УстановитьПараметр("Пол2", ДокНастройки.ПолитикаРаспределения.Выгрузить());
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Политика.Фонд,
	               |	Политика.Подразделение,
	               |	Политика.Раздел КАК Раздел
	               |ИЗ
	               |	Пол1 КАК Политика
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Политика.Раздел.Наименование
	               |ИТОГИ ПО
	               |	Раздел";				   
	//Минаев
	ДеревоПолитика1Знач = ДанныеФормыВЗначение(ЭтаФорма.ДеревоПолитика1,Тип("ДеревоЗначений"));
	ДеревоПолитика1Знач = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЗначениеВДанныеФормы(ДеревоПолитика1Знач,ЭтаФорма.ДеревоПолитика1);

	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Политика.Фонд,
	               |	Политика.Подразделение,
	               |	Политика.Раздел КАК Раздел
	               |ИЗ
	               |	Пол2 КАК Политика
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Политика.Раздел.Наименование
	               |ИТОГИ ПО
	               |	Раздел";				   
	//Минаев
	ДеревоПолитика2Знач = ДанныеФормыВЗначение(ЭтаФорма.ДеревоПолитика2,Тип("ДеревоЗначений"));			   
	ДеревоПолитика2Знач = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
 	ЗначениеВДанныеФормы(ДеревоПолитика2Знач,ЭтаФорма.ДеревоПолитика2);


КонецПроцедуры

&НаКлиенте
Процедура КомандаСуммаКРаспределению1(Команда)
	Элементы.ПолеФормула.ВыделенныйТекст = "[СКР1]";
	//КомандаСуммаКРаспределению1НаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаСуммаКРаспределению1НаСервере()
	// Вставить содержимое обработчика.
	ПолеФормула = "[СКР1]";
КонецПроцедуры

&НаКлиенте
Процедура КомандаСуммаКРаспределению2(Команда)
	Элементы.ПолеФормула.ВыделенныйТекст = "[СКР2]";
	//КомандаСуммаКРаспределению2НаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаСуммаКРаспределению2НаСервере()
	// Вставить содержимое обработчика.
	ПолеФормула = "[СКР2]";
КонецПроцедуры

&НаКлиенте
Процедура КомандаМаржинальнаяПрибыль(Команда)
	Элементы.ПолеФормула.ВыделенныйТекст = "[МаржПр]";
	//КомандаМаржинальнаяПрибыльНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаМаржинальнаяПрибыльНаСервере()
	// Вставить содержимое обработчика.
	ПолеФормула = "[МаржПр]";
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПолитика1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Если Элемент.ТекущиеДанные.Раздел = "СКД:" Тогда
		Элементы.ПолеФормула.ВыделенныйТекст = "[П1 Итог:"+Элемент.ТекущиеДанные.Раздел1+"]";
	ИначеЕсли Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Фонд) тогда
		Элементы.ПолеФормула.ВыделенныйТекст = "[П1 Итог:"+Элемент.ТекущиеДанные.Раздел+"]";
	Иначе
		Элементы.ПолеФормула.ВыделенныйТекст = "[П1 Сумма:"+Элемент.ТекущиеДанные.Подразделение+"$"+Элемент.ТекущиеДанные.Фонд+"]";
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоПолитика2Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные.Раздел = "СКД:" Тогда
		Элементы.ПолеФормула.ВыделенныйТекст = "[П2 Итог:"+Элемент.ТекущиеДанные.Раздел1+"]";
	ИначеЕсли Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Фонд) тогда
		Элементы.ПолеФормула.ВыделенныйТекст = "[П2 Итог:"+Элемент.ТекущиеДанные.Раздел+"]";
	Иначе
		Элементы.ПолеФормула.ВыделенныйТекст = "[П2 Сумма:"+Элемент.ТекущиеДанные.Подразделение+"$"+Элемент.ТекущиеДанные.Фонд+"]";
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДоходыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Элементы.ПолеФормула.ВыделенныйТекст = "[Доход:"+Элемент.ТекущиеДанные.Значение+"]";
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	ВладелецФормы.ТекущийЭлемент.ТекущиеДанные[ИмяЗаполняемогоПоля] = СокрЛП(ПолеФормула);
	
	ВладелецФормы.Элементы.ПолитикаРаспределенияПервичная.Обновить();
	ВладелецФормы.Элементы.ПолитикаРаспределения.Обновить();
	
	ВладелецФормы.Модифицированность = истина; 
	//ВладелецФормы.Записать();
	Закрыть(Истина);
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеСпецдоходаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Элементы.ПолеФормула.ВыделенныйТекст = "[СпецдоходРаспр:"+Элемент.ТекущиеДанные.Значение+"]";
КонецПроцедуры

&НаКлиенте
Процедура СпецдоходВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Элементы.ПолеФормула.ВыделенныйТекст = "[Спецдоход:"+Элемент.ТекущиеДанные.Значение+"]";
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИспользоватьРаспределениеСФондов = Константы.ИА_ИспользоватьРаспределениеСФондов.Получить();
	ИспользоватьСпецдоход = Константы.ИА_ИспользоватьСпецдоход.Получить();
	РазделятьНалБезнал            = Константы.ИА_ФП_РазделятьНалИБезнал.Получить();
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеСредствСФондов(Команда)
	подр = ПредопределенноеЗначение("Справочник.ИА_ЦФО.ПустаяСсылка");
	фонд = ПредопределенноеЗначение("Справочник.ИА_Фонды.ПустаяСсылка");
	ПоказатьВводЗначения(Новый ОписаниеОповещения("РаспределениеСредствСФондовЗавершение", ЭтотОбъект, Новый Структура("фонд, подр", фонд, подр)), подр, "Выберите подразделение");
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеСредствСФондовЗавершение(Значение, ДополнительныеПараметры) Экспорт
	
	фонд = ДополнительныеПараметры.фонд;
	подр = ?(Значение = Неопределено, ДополнительныеПараметры.подр, Значение);
	
	
	ПоказатьВводЗначения(Новый ОписаниеОповещения("РаспределениеСредствСФондовЗавершениеЗавершение", ЭтотОбъект, Новый Структура("Значение, подр, фонд", Значение, подр, фонд)), фонд, "Выберите фонд");

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеСредствСФондовЗавершениеЗавершение(Значение1, ДополнительныеПараметры1) Экспорт
	
	Значение = ДополнительныеПараметры1.Значение;
	подр = ДополнительныеПараметры1.подр;
	фонд = ?(Значение1 = Неопределено, ДополнительныеПараметры1.фонд, Значение1);
	
	
	Если (Значение <> Неопределено) И (Значение1 <> Неопределено) тогда
		Элементы.ПолеФормула.ВыделенныйТекст = "[РСФ Сумма:"+подр+"$"+фонд+"]";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РСФ_Итого(Команда)
	Элементы.ПолеФормула.ВыделенныйТекст = "[РСФИтого]";
КонецПроцедуры

&НаКлиенте
Процедура Доходы_Итого(Команда)
	Элементы.ПолеФормула.ВыделенныйТекст = "[ДоходыИтого]";
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеПоНалБезнал()
	
	Элементы.ФП_ДоходыСуммаНал.Видимость = РазделятьНалБезнал;
	Элементы.ФП_ДоходыСуммаБезнал.Видимость = РазделятьНалБезнал;
	
	Элементы.ФП_ДоходыИтого.Видимость = РазделятьНалБезнал;
	Элементы.ФП_Сумма.Видимость = не РазделятьНалБезнал;
	
	Элементы.ФП_ДеревоПолитикаПервичнаяСуммаНал.Видимость = РазделятьНалБезнал;
	Элементы.ФП_ДеревоПолитикаПервичнаяСуммаБезнал.Видимость = РазделятьНалБезнал;
	Элементы.ФП_ДеревоПолитикаПервичнаяИтого.Видимость = РазделятьНалБезнал;
	Элементы.ФП_ДеревоПолитикаПервичнаяСумма.Видимость = не РазделятьНалБезнал;
	
	Элементы.ФП_ДоходыБП_РаспределениеСуммаНал.Видимость = РазделятьНалБезнал;
	Элементы.ФП_ДоходыБП_РаспределениеСуммаБезнал.Видимость = РазделятьНалБезнал;
	Элементы.ФП_ДоходыБП_РаспределениеСумма.Видимость = не РазделятьНалБезнал;
	
	Элементы.ФП_ДоходыБПСуммаНал.Видимость = РазделятьНалБезнал;
	Элементы.ФП_ДоходыБПСуммаБезнал.Видимость = РазделятьНалБезнал;
	Элементы.ФП_ДоходыБПСумма.Видимость = не РазделятьНалБезнал;
	
	Элементы.ФП_ДеревоПолитикаСуммаНал.Видимость = РазделятьНалБезнал;
	Элементы.ФП_ДеревоПолитикаСуммаБезнал.Видимость = РазделятьНалБезнал;
	Элементы.ФП_ДеревоПолитикаИтого.Видимость = РазделятьНалБезнал;
	Элементы.ФП_ДеревоПолитикаСумма.Видимость = не РазделятьНалБезнал;
	
	Элементы.ФП_РаспределениеСредствСФондовСуммаНал.Видимость = РазделятьНалБезнал;
	Элементы.ФП_РаспределениеСредствСФондовСуммаБезНал.Видимость = РазделятьНалБезнал;
	Элементы.ФП_РаспределениеСредствСФондовСумма.Видимость = не РазделятьНалБезнал;
	
	Если не РазделятьНалБезнал Тогда
		Элементы.ФП_НадписьСуммаКРаспр1.Заголовок = СтрЗаменить(Элементы.ФП_НадписьСуммаКРаспр1.Заголовок, "(нал/безнал)", "");
		Элементы.ФП_НадписьСуммаКРаспр.Заголовок = СтрЗаменить(Элементы.ФП_НадписьСуммаКРаспр.Заголовок, "(нал/безнал)", "");
		Элементы.ФП_НадписьНераспрСумма.Заголовок = СтрЗаменить(Элементы.ФП_НадписьНераспрСумма.Заголовок, "(нал/безнал)", "");
		Элементы.ФП_НадписьМаржа.Заголовок = СтрЗаменить(Элементы.ФП_НадписьМаржа.Заголовок, "(нал/безнал)", "");
		Элементы.ФП_НадписьСуммаРаспр.Заголовок = СтрЗаменить(Элементы.ФП_НадписьСуммаРаспр.Заголовок, "(нал/безнал)", "");
		
		Элементы.ФП_Декорация2.Видимость = Ложь;
		Элементы.ФП_Декорация4.Видимость = Ложь;
		Элементы.ФП_Декорация9.Видимость = Ложь;
		Элементы.ФП_Декорация11.Видимость = Ложь;
		Элементы.ФП_Декорация13.Видимость = Ложь;
		
		Элементы.ФП_ПредварительнаяСуммаКРаспределениюИтого1.Видимость = Ложь;
		Элементы.ФП_ПредварительнаяСуммаКРаспределениюИтого.Видимость = Ложь;
		Элементы.ФП_НераспределяемаяСуммаИтого.Видимость = Ложь;
		Элементы.ФП_МаржинальнаяПрибыльИтого.Видимость = Ложь;
		Элементы.ФП_СуммаКРаспределениюИтого.Видимость = Ложь;
		
		Элементы.ФП_ПредварительнаяСуммаКРаспределениюНал.Видимость = Ложь;
		Элементы.ФП_ПредварительнаяСуммаКРаспределениюНал1.Видимость = Ложь;
		Элементы.ФП_НераспределяемаяСуммаНал.Видимость = Ложь;
		Элементы.ФП_МаржинальнаяПрибыльНал.Видимость = Ложь;
		Элементы.ФП_СуммаКРаспределениюНал.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктДокНастройкиФП(знач Доходы_Настр, знач ПолитикаРаспределения_Настр, знач ПолитикаРаспределенияПервичная_Настр)  
	Рез = Новый Структура("Доходы,ПолитикаРаспределения,ПолитикаРаспределенияПервичная", Доходы_Настр.Выгрузить(),ПолитикаРаспределения_Настр.Выгрузить(), ПолитикаРаспределенияПервичная_Настр.Выгрузить());
	Возврат ЗначениеВСтрокуВнутр(Рез);
КонецФункции

&НаКлиенте
Процедура ПроверитьФормулу(Команда)
	//Если Вопрос("Для проверки формулы необходимо записать политику. Продолжить?", РежимДиалогаВопрос.ДаНет)<>КодВозвратаДиалога.Да Тогда
	//	Возврат;
	//КонецЕсли;
	
	ВладелецФормы.ТекущийЭлемент.ТекущиеДанные[ИмяЗаполняемогоПоля] = СокрЛП(ПолеФормула);
	//ВладелецФормы.Записать();
	
	Если ФормаФП = Неопределено Тогда
		ФормаФП = ПолучитьФорму("Документ.ИА_ФинансовоеПланирование.ФормаОбъекта",,,"НастройкаФП");
		
		ФормаФП.ИспользоватьСлужебнуюНастройку = истина;
		ФормаФП.СохранятьРассчитаныеФормыПоБезнал = ЭтоБезнал;
		ФормаФП.объект.Дата = ТекущаяДата();
		Если ФормаФП.ФППоОрганизациям Тогда
			ФормаФП.объект.Организация = Организация;
		КонецЕсли;
	КонецЕсли;
	
	ФормаФП.СлужебнаяНастройкаФП = ПолучитьСтруктДокНастройкиФП(ВладелецФормы.Объект.Доходы, ВладелецФормы.Объект.ПолитикаРаспределения,ВладелецФормы.Объект.ПолитикаРаспределенияПервичная);
	
	ФормаФП.КомандаОбновитьДокумент(Неопределено);
	
	ЗаполнитьФП();
	
	ФормаФП.ОсновнойПерерасчет(1);
	ПеренестиРезультатФПВФорму();
	
	// отобразим результат
	РезультатФормулы = "";
	Для каждого стр из ФормаФП.РассчитанныеФормулы Цикл
		если стр.Формула = ПолеФормула Тогда
			РезультатФормулы = стр.ПредставлениеФормулы + " = " + стр.Результат;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиРезультатФПВФорму()
	// очистка
	ФП_Доходы.Очистить();
	ФП_ДеревоПолитикаПервичная.ПолучитьЭлементы().Очистить();
	ФП_РаспределениеСредствСФондов.Очистить();
	ФП_ДоходыБП.Очистить();
	ФП_ДоходыБП_Распределение.Очистить();
	ФП_ДеревоПолитика.ПолучитьЭлементы().Очистить();
	
	// доходы
	Для каждого стр из ФормаФП.Объект.Доходы Цикл
		Новстр = ФП_Доходы.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, стр);
		Новстр.Итого = Новстр.СуммаНал + Новстр.СуммаБезнал;
	КонецЦикла;
	
	// Политика 1
	Для каждого стрРаздел из ФормаФП.ДеревоПолитикаПервичная.ПолучитьЭлементы() Цикл
		Новстр = ФП_ДеревоПолитикаПервичная.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, стрРаздел);
		Если Новстр.Раздел <>"СКД:" Тогда
			ПредРаздел =  Новстр.Раздел;
		Иначе
			Новстр.Раздел1 = ПредРаздел;
		КонецЕсли;
		Для каждого стрФонд из стрРаздел.ПолучитьЭлементы() Цикл
			Новстр2 = Новстр.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(Новстр2, стрФонд);
		КонецЦикла;
	КонецЦикла;
	
	// Распределение средств с фондов
	Для каждого стр из ФормаФП.Объект.РаспределениеСредствСФондов Цикл
		Новстр = ФП_РаспределениеСредствСФондов.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, стр);
	КонецЦикла;
	
	// Спецдоход
	Для каждого стр из ФормаФП.Объект.ДоходыБП Цикл
		Новстр = ФП_ДоходыБП.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, стр);
	КонецЦикла;

	// Распределение Спецдохода
	Для каждого стр из ФормаФП.Объект.ДоходыБП_Распределение Цикл
		Новстр = ФП_ДоходыБП_Распределение.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, стр);
	КонецЦикла;
	
	// Политика 2
	Для каждого стрРаздел из ФормаФП.ДеревоПолитика.ПолучитьЭлементы() Цикл
		Новстр = ФП_ДеревоПолитика.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, стрРаздел);
		Если Новстр.Раздел <>"СКД:" Тогда
			ПредРаздел =  Новстр.Раздел;
		Иначе
			Новстр.Раздел1 = ПредРаздел;
		КонецЕсли;
		Для каждого стрФонд из стрРаздел.ПолучитьЭлементы() Цикл
			Новстр2 = Новстр.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(Новстр2, стрФонд);
		КонецЦикла;
	КонецЦикла;
	
	// реквизиты
	ФП_МаржинальнаяПрибыльБезнал = ФормаФП.Объект.МаржинальнаяПрибыльБезнал;
	ФП_МаржинальнаяПрибыльИтого = ФормаФП.МаржинальнаяПрибыльИтого;
	ФП_МаржинальнаяПрибыльНал = ФормаФП.Объект.МаржинальнаяПрибыльНал;
	ФП_НераспределяемаяСуммаБезнал = ФормаФП.Объект.НераспределяемаяСуммаБезнал;
	ФП_НераспределяемаяСуммаИтого = ФормаФП.НераспределяемаяСуммаИтого;
	ФП_НераспределяемаяСуммаНал = ФормаФП.Объект.НераспределяемаяСуммаНал;
	ФП_ПредварительнаяСуммаКРаспределениюБезнал = ФормаФП.Объект.ПредварительнаяСуммаКРаспределениюБезнал;
	ФП_ПредварительнаяСуммаКРаспределениюБезнал1 = ФормаФП.Объект.ПредварительнаяСуммаКРаспределениюБезнал1;
	ФП_ПредварительнаяСуммаКРаспределениюИтого = ФормаФП.ПредварительнаяСуммаКРаспределениюИтого;
	ФП_ПредварительнаяСуммаКРаспределениюИтого1 = ФормаФП.ПредварительнаяСуммаКРаспределениюИтого1;
	ФП_ПредварительнаяСуммаКРаспределениюНал = ФормаФП.Объект.ПредварительнаяСуммаКРаспределениюНал;
	ФП_ПредварительнаяСуммаКРаспределениюНал1 = ФормаФП.Объект.ПредварительнаяСуммаКРаспределениюНал1;
	ФП_СуммаКРаспределениюБезнал = ФормаФП.Объект.СуммаКРаспределениюБезнал;
	ФП_СуммаКРаспределениюИтого = ФормаФП.СуммаКРаспределениюИтого;
	ФП_СуммаКРаспределениюНал = ФормаФП.Объект.СуммаКРаспределениюНал;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФП()
	
	// доходы
	ТекДоход = 1000000;
	Для каждого стр из ФормаФП.Объект.Доходы Цикл
		Если РазделятьНалБезнал Тогда
			стр.СуммаНал = ТекДоход; 
		КонецЕсли;
		стр.СуммаБезнал = ТекДоход;
		ТекДоход = ТекДоход + 50000;
	КонецЦикла;
	
	// политика 1
	ТекСуммаФонда = 10000;
	Для каждого стрРаздел из ФормаФП.ДеревоПолитикаПервичная.ПолучитьЭлементы() Цикл
		Для каждого стрФонд из стрРаздел.ПолучитьЭлементы() Цикл
			если стрФонд.РежимРасчета = ПредопределенноеЗначение("Перечисление.ИА_РежимРасчетаСуммы.РучнойВвод") Тогда
				Если РазделятьНалБезнал Тогда
					стрФонд.СуммаНал = ТекСуммаФонда; 
				КонецЕсли;
				стрФонд.СуммаБезнал = ТекСуммаФонда;
				стрФонд.Итого = стрФонд.СуммаНал + стрФонд.СуммаБезнал;
				ТекСуммаФонда = ТекСуммаФонда + 3000;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// спецдоход
	ФормаФП.Объект.ДоходыБП.Очистить();
	ТекСуммаСпец = 10000;
	Для каждого стр из Спецдоход Цикл
		Новстр = ФормаФП.Объект.ДоходыБП.Добавить();
		Новстр.ВидДохода = стр.Значение;
		Новстр.СуммаБезнал = ТекСуммаСпец;
		Если РазделятьНалБезнал Тогда
			Новстр.СуммаНал = ТекСуммаСпец; 
		КонецЕсли;
		
		ТекСуммаСпец = ТекСуммаСпец + 3000;
	КонецЦикла;
	
	// распределение спецдохода
	ФормаФП.Объект.ДоходыБП_Распределение.Очистить();
	ТекСуммаСпец = 20000;
	Для каждого стр из Спецдоход Цикл
		Новстр = ФормаФП.Объект.ДоходыБП_Распределение.Добавить();
		Новстр.ВидДохода = стр.Значение;
		Новстр.СуммаБезнал = ТекСуммаСпец;
		Если РазделятьНалБезнал Тогда
			Новстр.СуммаНал = ТекСуммаСпец; 
		КонецЕсли;
		
		ТекСуммаСпец = ТекСуммаСпец + 3000;
	КонецЦикла;
	
	// политика 2
	ТекСуммаФонда = 10000;
	Для каждого стрРаздел из ФормаФП.ДеревоПолитика.ПолучитьЭлементы() Цикл
		Для каждого стрФонд из стрРаздел.ПолучитьЭлементы() Цикл
			если стрФонд.РежимРасчета = ПредопределенноеЗначение("Перечисление.ИА_РежимРасчетаСуммы.РучнойВвод") Тогда
				Если РазделятьНалБезнал Тогда
					стрФонд.СуммаНал = ТекСуммаФонда; 
				КонецЕсли;
				стрФонд.СуммаБезнал = ТекСуммаФонда;
				стрФонд.Итого = стрФонд.СуммаНал + стрФонд.СуммаБезнал;
				ТекСуммаФонда = ТекСуммаФонда + 3000;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ФП_ДоходыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Элементы.ПолеФормула.ВыделенныйТекст = "[Доход:"+Элемент.ТекущиеДанные.ВидДохода+"]";
КонецПроцедуры

&НаКлиенте
Процедура ФП_ДоходыБПВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Элементы.ПолеФормула.ВыделенныйТекст = "[Спецдоход:"+Элемент.ТекущиеДанные.ВидДохода+"]";
КонецПроцедуры

&НаКлиенте
Процедура ФП_ДоходыБП_РаспределениеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Элементы.ПолеФормула.ВыделенныйТекст = "[СпецдоходРаспр:"+Элемент.ТекущиеДанные.ВидДохода+"]";
КонецПроцедуры

&НаКлиенте
Процедура СписокЗапросовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	Элементы.ПолеФормула.ВыделенныйТекст = "[Запрос:"+Элемент.ТекущиеДанные.Наименование+"]";
КонецПроцедуры
